driver-tests/bpelse/nmproperty/HttpOutBoundHeaderTest_bpel/src/accessCONTENTTYPE.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="accessCONTENTTYPE" targetNamespace="http://j2ee.netbeans.org/wsdl/HttpOutBoundHeaderTest_bpel/accessCONTENTTYPE"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/HttpOutBoundHeaderTest_bpel/accessCONTENTTYPE" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="accessCONTENTTYPEOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="accessCONTENTTYPEOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="accessCONTENTTYPEPortType">
        <operation name="accessCONTENTTYPEOperation">
            <input name="input1" message="tns:accessCONTENTTYPEOperationRequest"/>
            <output name="output1" message="tns:accessCONTENTTYPEOperationResponse"/>
        </operation>
    </portType>
    <binding name="accessCONTENTTYPEBinding" type="tns:accessCONTENTTYPEPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="accessCONTENTTYPEOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/HttpOutBoundHeaderTest_bpel/accessCONTENTTYPE"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/HttpOutBoundHeaderTest_bpel/accessCONTENTTYPE"/>
            </output>
        </operation>
    </binding>
    <service name="accessCONTENTTYPEService">
        <port name="accessCONTENTTYPEPort" binding="tns:accessCONTENTTYPEBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/accessCONTENTTYPEService/accessCONTENTTYPEPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="accessCONTENTTYPE">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="accessCONTENTTYPEPortTypeRole" portType="tns:accessCONTENTTYPEPortType"/>
    </plnk:partnerLinkType>
</definitions>
