driver-tests/bpelse/nmproperty/HttpOutBoundHeaderTest_jbi/test/acessContentType/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://j2ee.netbeans.org/wsdl/HttpOutBoundHeaderTest_bpel/accessCONTENTTYPE">
  <soapenv:Body>
    <acc:accessCONTENTTYPEOperation>
      <part1>Test</part1>
    </acc:accessCONTENTTYPEOperation>
  </soapenv:Body>
</soapenv:Envelope>